In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dataset = pd.read_csv(r"Groceries_dataset.csv")

In [4]:
dataset.head(10)

   Member_number        Date   itemDescription
0           1808  21-07-2015    tropical fruit
1           2552  05-01-2015        whole milk
2           2300  19-09-2015         pip fruit
3           1187  12-12-2015  other vegetables
4           3037  01-02-2015        whole milk
5           4941  14-02-2015        rolls/buns
6           4501  08-05-2015  other vegetables
7           3803  23-12-2015        pot plants
8           2762  20-03-2015        whole milk
9           4119  12-02-2015    tropical fruit

In [7]:
dataset.isnull().sum()

Member_number      0
Date               0
itemDescription    0
dtype: int64

In [9]:
dataset.describe()

       Member_number
count   38765.000000
mean     3003.641868
std      1153.611031
min      1000.000000
25%      2002.000000
50%      3005.000000
75%      4007.000000
max      5000.000000

In [10]:
import collections

In [11]:
col = collections.Counter(dataset)

In [12]:
col.keys(),col.values()

(dict_keys(['Member_number', 'Date', 'itemDescription']),
 dict_values([1, 1, 1]))

In [13]:
datas = {
    "itemname":col.keys(),
    "vaules":col.values()
}

In [14]:
datas

{'itemname': dict_keys(['Member_number', 'Date', 'itemDescription']),
 'vaules': dict_values([1, 1, 1])}

In [16]:
pd.DataFrame(datas).sort_values(by=["vaules"],ascending=False)

          itemname  vaules
0    Member_number       1
1             Date       1
2  itemDescription       1

In [17]:
from mlxtend.preprocessing.transactionencoder import TransactionEncoder

In [18]:
tr=TransactionEncoder()
tr.fit(datas)
dataset = pd.DataFrame(tr.transform(datas),columns = tr.columns_)

In [19]:
dataset

      a     e      i      l      m      n      s      t      u      v
0  True  True   True  False   True   True  False   True  False  False
1  True  True  False   True  False  False   True  False   True   True

In [20]:
from mlxtend.frequent_patterns import apriori

In [21]:
ar = apriori(dataset,min_support=0.07,use_colnames = True,max_len=3).sort_values(by=["support"])

In [22]:
ar

    support   itemsets
39      0.5  (i, a, e)
56      0.5  (u, a, s)
55      0.5  (t, a, n)
54      0.5  (m, a, t)
53      0.5  (m, a, n)
..      ...        ...
23      0.5     (e, s)
22      0.5     (e, n)
1       1.0        (e)
10      1.0     (a, e)
0       1.0        (a)

[79 rows x 2 columns]